## DATA WRANGLING AND CLEANING

### Importing Libraries
The first part of any data science project is preparing your data, which means making sure its in the right place and format for you to conduct your analysis. The first step of any data preparation is importing your raw data and cleaning it.

If you look in the small-data directory on your machine, you'll see that the data for this project comes in three CSV files: mexico-real-estate-1.csv, mexico-real-estate-2.csv, and mexico-real-estate-3.csv.

In [1]:
import pandas as pd

In [10]:
# Load CSV files into DataFrames
df1 = pd.read_csv("data/mexico-real-estate-1.csv",encoding="ISO-8859-1")
df2 = pd.read_csv("data/mexico-real-estate-2.csv",encoding="ISO-8859-1")
df3 = pd.read_csv("data/mexico-real-estate-3.csv",encoding="ISO-8859-1")

# Print object type and shape for DataFrames
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
print()
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
print()
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)

df1 type: <class 'pandas.core.frame.DataFrame'>
df1 shape: (700, 7)

df2 type: <class 'pandas.core.frame.DataFrame'>
df2 shape: (700, 7)

df3 type: <class 'pandas.core.frame.DataFrame'>
df3 shape: (700, 6)

### Clean df1
Inspect df1 by looking at its shape attribute. Then use the info method to see the data types and number of missing values for each column. Finally, use the head method to determine to look at the first five rows of your dataset.

In [11]:
# Print df1 shape
df1.shape

# Print df1 info
df1.info

# Get output of df1 head
df1.head()

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,2,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,3,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,4,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,5,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

Clean df1 by dropping rows with NaN values. Then remove the "$" and "," characters from "price_usd" and recast the values in the column as floats.

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            583 non-null    float64
 4   lon            583 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_usd      700 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 38.4+ KB

In [13]:
# Drop null values from df1
df1.dropna(inplace=True)

# Clean "price_usd" column in df1
df1["price_usd"] = (
                    df1["price_usd"]
                    .str.replace("$","",regex=False)
                    .str.replace(",","",regex=False)
                    .astype(float))


# Print object type, shape, and head
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
df1.head()

df1 type: <class 'pandas.core.frame.DataFrame'>
df1 shape: (583, 7)

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,67965.56
1,2,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,3,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,4,apartment,Guerrero,16.829782,-99.911012,150,94308.80
5,6,house,Yucatán,21.052583,-89.538639,205,105191.37

### Clean df2
Now it's time to tackle df2. Take a moment to inspect it using the same commands you used before. You'll notice that it has the same issue of NaN values, but there's a new problem, too: The home prices are in Mexican pesos ("price_mxn"), not US dollars ("price_usd"). If we want to compare all the home prices in this dataset, they all need to be in the same currency.

First, drop rows with NaN values in df2. Next, use the "price_mxn" column to create a new column named "price_usd". (Keep in mind that, when this data was collected in 2014, a dollar cost 19 pesos.) Finally, drop the "price_mxn" from the DataFrame.

In [14]:
df2.shape

(700, 7)

In [15]:
df2.dropna(inplace=True)

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 571 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     571 non-null    int64
 1   property_type  571 non-null    object
 2   state          571 non-null    object
 3   lat            571 non-null    float64
 4   lon            571 non-null    float64
 5   area_m2        571 non-null    int64
 6   price_mxn      571 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 35.7+ KB

In [17]:
# Create "price_usd" column for df2 (19 pesos to the dollar in 2014)
df2["price_usd"] = (df2["price_mxn"]/19).round(2)

# Drop "price_mxn" column from df2
df2.drop(columns = ["price_mxn"],inplace=True)

# Print object type, shape, and head
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
df2.head()

df2 type: <class 'pandas.core.frame.DataFrame'>
df2 shape: (571, 7)

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,apartment,Nuevo León,25.721081,-100.345581,72,68421.05
2,3,house,Morelos,23.634501,-102.552788,360,278947.37
6,7,apartment,Estado de México,19.272040,-99.572013,85,65789.47
7,8,house,San Luis Potosí,22.138882,-100.996510,158,111578.95
8,9,apartment,Distrito Federal,19.394558,-99.129707,65,39904.74

### Clean df3
Great work! We're now on the final DataFrame. Use the same shape, info and head commands to inspect the df3. Do you see any familiar issues?

You'll notice that we still have NaN values, but there are two new problems:

Instead of separate "lat" and "lon" columns, there's a single "lat-lon" column.
Instead of a "state" column, there's a "place_with_parent_names" column.
We need the resolve these problems so that df3 has the same columns in the same format as df1 and df2.

Drop rows with NaN values in df3. Then use the split method to create two new columns from "lat-lon" named "lat" and "lon", respectively.

In [18]:
df3.dropna(inplace=True)
df3[["lat","lon"]] = df3["lat-lon"].str.split(",",expand=True)
df3.head()

,Unnamed: 0,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,1,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,2,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534
2,3,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69,19.268629,-99.671722
4,5,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67,19.511938,-96.871956
5,6,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00,20.689157,-103.366728

In [19]:
df3["place_with_parent_names"].head()

0    |México|Distrito Federal|Gustavo A. Madero|Acu...
1             |México|Estado de México|Toluca|Metepec|
2    |México|Estado de México|Toluca|Toluca de Lerd...
4    |México|Veracruz de Ignacio de la Llave|Veracruz|
5                         |México|Jalisco|Guadalajara|
Name: place_with_parent_names, dtype: object

In [20]:
# Create "state" column for df3
df3["state"] = df3["place_with_parent_names"].str.split("|",expand= True)[2]

# Drop "place_with_parent_names" and "lat-lon" from df3
df3.drop(columns = ["lat-lon","place_with_parent_names"], inplace=True) 

# Print object type, shape, and head
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)
df3.head()

df3 type: <class 'pandas.core.frame.DataFrame'>
df3 shape: (582, 7)

,Unnamed: 0,property_type,area_m2,price_usd,lat,lon,state
0,1,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,2,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,3,house,300,86932.69,19.268629,-99.671722,Estado de México
4,5,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,6,house,175,102763.00,20.689157,-103.366728,Jalisco

### Concatenate DataFrames
Great work! You have three clean DataFrames, and now it's time to combine them into a single DataFrame so that you can conduct your analysis.

In [21]:
# Concatenate df1, df2, and df3
df = pd.concat([df1,df2,df3])

# Print object type, shape, and head
print("df type:", type(df))
print("df shape:", df.shape)
df.head()

df type: <class 'pandas.core.frame.DataFrame'>
df shape: (1736, 7)

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,67965.56
1,2,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,3,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,4,apartment,Guerrero,16.829782,-99.911012,150,94308.80
5,6,house,Yucatán,21.052583,-89.538639,205,105191.37

### Save df
The data is clean and in a single DataFrame, and now you need to save it as a CSV file so that you can examine it in your exploratory data analysis

In [22]:
# Save df
df.to_csv("data/mexico-real-estate-clean.csv")